Repository: nhantringuyen/plugin
Catalog: woocommerce-frequently-bought-together/languages/woocommerce-frequently-bought-together-*.po
Languages: id_id

source: Woocommerce Frequently Bought Together
id_id: Sering Dibeli Bersama Woocommerce

source: Frequently bought together plugin to display frequently bought products on product detail page and cart page.
id_id: Pengaya sering dibeli bersama untuk menampilkan produk-produk yang dibeli bersama pada halaman rincian produk dan halaman keranjang belanja.

source: Aheadzen Team
id_id: Tim Aheadzen

source: Customers Who Bought Items in Your Cart Also Bought
id_id: Pelanggan yang Membeli Produk di Keranjang Belanja Anda Juga Membeli

source: Customers Who Bought This Item Also Bought
id_id: Pelanggan yang Membeli Produk Ini Juga Membeli

source: Frequently Bought Together
id_id: Sering Dibeli Bersama

source: Add 3 Items To Cart
id_id: Tambahkan 3 Produk ke Keranjang Belanja

source: Add Both Items To Cart
id_id: Tambahkan Kedua Produk ke Keranjang Belanja

source: Add To Cart
id_id: Tambahkan ke Keranjang Belanja

source: Select Atleast One Item
id_id: Pilih Setidaknya Satu Produk
