Repository: nhantringuyen/plugin
Catalog: devvn-quick-buy/languages/devvn-quickbuy-*.po
Languages: vi

source: Your information
vi: Thông tin người mua

source: Mr
vi: Anh

source: Mrs
vi: Chị

source: Full name
vi: Họ và tên

source: Phone number
vi: Số điện thoại

source: Confirm your phone number
vi: Nhập lại số điện thoại

source: Email
vi: Địa chỉ email

source: Email (Not required)
vi: Địa chỉ email (Không bắt buộc)

source: Address
vi: Địa chỉ

source: (Not required)
vi: (Không bắt buộc)

source: City
vi: Tỉnh/Thành phố

source: District
vi: Quận/huyện

source: Ward
vi: Xã/Phường

source: Street
vi: Số nhà, tên đường

source: Note (Not required)
vi: Ghi chú đơn hàng (Không bắt buộc)

source: Shipping:
vi: Vận chuyển:

source: Payment methob
vi: Hình thức thanh toán

source: Coupon code
vi: Mã giảm giá

source: Apply
vi: Áp dụng

source: Total:
vi: Tổng:

source: Buy Now
vi: Đặt hàng ngay

source: Settings
vi: Cài đặt

source: Quantity
vi: Số lượng

source: Full name is required
vi: Họ và tên là bắt buộc

source: Phone number is required
vi: Số điện thoại là bắt buộc

source: Confirm your phone number is required
vi: Nhập lại số điện thoại là bắt buộc

source: Please enter the same phone number again
vi: Vui lòng nhập lại cùng số điện thoại

source: Email is required
vi: Email là bắt buộc

source: District is required
vi: Quận huyện là bắt buộc

source: Ward is required
vi: Xã/Phường là bắt buộc

source: Stress is required
vi: Số nhà, tên đường là bắt buộc

source: Quick Buy Setting
vi: Cài đặt mua nhanh

source: General settings
vi: Cài Đặt Chung

source: Enable
vi: Bật

source: Active
vi: Kích hoạt

source: Deactive
vi: Ngừng kích hoạt

source: Select location
vi: Chọn tỉnh/thành phố

source: Requires have state
vi: Yêu cầu cần có State

source: Shipping
vi: Vận chuyển

source: Hidden Email
vi: Ẩn email

source: Require Email
vi: Bắt buộc điền Email

source: Require District
vi: Bắt buộc chọn quận/huyện

source: Require
vi: Bắt buộc

source: Require Village
vi: Bắt buộc chọn xã/phường

source: Require Address box
vi: Bắt buộc nhập địa chỉ

source: Enable Payment methob
vi: Kích hoạt chọn hình thức thanh toán

source: Yes/No
vi: Có/Không

source: Hidden Note
vi: Ẩn mục ghi chú đơn hàng

source: Hidden Address
vi: Ẩn ô nhập địa chỉ

source: Valid Phone
vi: Xác nhận lại SĐT

source: Button quick buy
vi: Nút mua nhanh

source: Button text
vi: Chữ ở nút mua nhanh

source: Button sub text
vi: Chữ nhỏ ở nút mua nhanh

source: Popup setting
vi: Cài đặt popup

source: View product info on mobile
vi: Hiển thị khung thông tin sản phẩm trong popup trên mobile

source: Yes
vi: Có

source: No
vi: Không

source: Popup title
vi: Tiêu đề popup

source: %s to view product title
vi: %s để hiển thị tiêu đề sản phẩm

source: Popup mess
vi: Lời ghi chú trong popup

source: Go to thank you page
vi: Chuyển đến trang cảm ơn khi đặt hàng xong

source: Checkout successfully mess
vi: Lời nhắn khi mua hàng thành công

source: Type %%order_id%% to view Order ID
vi: Điền %%order_id%% để hiển thị ID của đơn hàng

source: Checkout error message
vi: Lời nhắn khi mua hàng thất bại

source: <strong>Gửi email + domain qua <a href="%s" target="_blank">facebook</a> để nhận license<strong>
vi: <strong>Nếu bạn đã mua mà chưa có license. Hãy gửi lại email + domain qua <a href="%s" target="_blank">facebook</a> cho tôi để nhận license</strong>
