Repository: nhantringuyen/plugin
Catalog: fulltext-search/languages/wpfts_lang-*.po
Languages: ru_ru

source: %s posts has been rebuilt
ru_ru: %s записей проиндексировано

source: (`Cluster` is a part of post (either title, content or even specific part which you can define using <b>wpfts_index_post</b> filter). You can assign some relevance weight to each of them)
ru_ru: (`Кластер` - это часть поста (например, Заголовок, Содержимое или другая часть, которую вы можете создать используя фильтр <b>wpfts_index_post</b>). Вы можете задать каждому кластеру свой весовой коэффициент релевантности.)

source: (Consider a word that is found in the specified or more amount of documents as a stop word.)
ru_ru: (Считать слово, которое встречается в указанном или бОльшем количестве документов стоп-словом.)

source: (Consider any word shorter than specified number of characters as a <a data-hint="%1s" href="%2s" target="_blank">stop word</a>.)
ru_ru: (Считать <a data-hint="%1s" href="%2s" target="_blank">стоп-словом</a> любое слово, содержащее меньшее количество символов, чем указанное здесь.)

source: (If not enabled, regular integrated "not indexed" WordPress search will be used)
ru_ru: (Если не включен, то при поиске будет использоваться обычный неиндексирующий алгоритм WordPress)

source: (Normally, WP FullText Search will autoindex any new post or post changes even if you disabled previous option. Disabling this option will completely stop all plugin functions. However, you probably have to do a full index rebuild, if you activate the plugin again.)
ru_ru: (Как правило, WP FullText Search автоматически добавляет и обновляет индекс для каждого поста, даже если вы отключили предыдущую опцию. Отключение индексирования полностью отключит все функции плагина. Однако, вероятно, вам придётся сделать полное реиндексирование, если вы решите включить эту опцию обратно.)

source: (This option tells the search engine whether all query words should contain in the found post (AND) or any of these words (OR).)
ru_ru: (Эта опция позволяет искать записи, в которых есть все искомые слова (AND) или любое из этих слов (OR).)

source: (Use this button when you need to completely rebuild search index database, for example, when you changed custom <b>wpfts_index_post</b> filter function. Remember that this operation could take a long time. Please refer for <a href="%s" target="_blank">documentation</a> for more information.)
ru_ru: (Эта кнопка запустит полное перестроение поискового индекса. Это бывает необходимо, если вы, например, изменили функцию фильтра <b>wpfts_index_post</b>. Помните, что этот процесс занимает некоторое время, в течение которого WordPress будет использовать обычный поиск. Обратитесь к <a href="%s" target="_blank">документации</a>, чтобы узнать больше.)

source: * (Any)
ru_ru: * (Любой)

source: <b>Stop Word</b> is a word which is not indexing and can not be used to search for.
ru_ru: <b>Стоп-слово</b> - это слово, которое не индексируется и не может быть использовано для поиска.

source: <strong>NOTE</strong>: Disabling this option is NOT recommended!
ru_ru: <strong>ВНИМАНИЕ</strong>: Отключение этой опции НЕ рекомендуется!

source: A comma-separated list of custom stop words
ru_ru: Список стоп-слов через запятую

source: Active
ru_ru: Работает

source: Actual
ru_ru: Актуальных

source: Additional Options:
ru_ru: Дополнительные опции:

source: auto-draft (Auto-Draft)
ru_ru: auto-draft (Автосохранённый)

source: Auto-index
ru_ru: Автоиндексирование

source: Awaiting
ru_ru: Ожидание

source: characters
ru_ru: символов

source: Cluster Weights
ru_ru: Веса Кластеров

source: Content
ru_ru: Содержимое

source: Default Search Logic
ru_ru: Логика поиска по-умолчанию

source: Disable SQL cache
ru_ru: Отключить кэш MySQL

source: Disable WPFTS
ru_ru: Отключить WPFTS

source: Disabled
ru_ru: Выключен

source: Display Attachments
ru_ru: Показать файлы

source: Download
ru_ru: Скачать

source: draft (Draft)
ru_ru: draft (Черновик)

source: Enable FullText Search
ru_ru: Разрешить FullText Search

source: Enable Smart Excerpts
ru_ru: Включить Умные цитаты

source: Enabled
ru_ru: Включено

source: Error:
ru_ru: Ошибка:

source: Est. time left:
ru_ru: Ост. времени:

source: File Extension
ru_ru: Расширение файла

source: File Size
ru_ru: Размер файла

source: Filesize
ru_ru: Размер файла

source: Filter result is not array. Please read <a href="%s" target="_blank">documentation</a> to fix this error.
ru_ru: Результат фильтра не является массивом. Пожалуйста, прочтите <a href="%s" target="_blank">документацию</a> чтобы это исправить.

source: Finish Now
ru_ru: Завершить сейчас

source: For Attachments: (PRO only)
ru_ru: Для аттачей: (только в PRO)

source: Found: <b>%d</b> posts
ru_ru: Найдено: <b>%d</b> записей

source: Friends, I need a new laptop. My old one is very slow and it's hard to make frequent updated of the WPFTS plugin. I need your help.<br> <b>Thank you!</b>
ru_ru: Друзья, мне нужен новый компьютер. Мой старый зависает и поэтому сложно делать частые обновления плагина. Мне очень нужна ваша помощь.<br><b>Спасибо!</b>

source: future (Future)
ru_ru: future (Запланирован)

source: Implementing a true indexed full-text search over wordpress posts and metas without using any external indexing software.
ru_ru: Добавляет индексированный поиск, поиск по мета-тегам и другие функции без установки внешних индексирующих программ.

source: In Index
ru_ru: В индексе

source: In the process of indexing your site might run slower. Please do not worry and wait until index finishing.
ru_ru: В процессе индексирования сайт может работать медленнее обычного. Не беспокойтесь и дождитесь окончания индексирования.

source: Include Attachments
ru_ru: Включать аттачи

source: Include to excerpt:
ru_ru: Включить в цитату:

source: Index is OK
ru_ru: Индекс в порядке

source: Indexing Engine
ru_ru: Индексирующий движок

source: Indexing Engine Settings
ru_ru: Поисковый движок

source: Indexing is disabled
ru_ru: Индексирование отключено

source: Indexing is in progress
ru_ru: Идёт индексирование

source: inherit (Inherit)
ru_ru: inherit (Дочерний)

source: License key saved!
ru_ru: Лицензионный ключ сохранён!

source: Link Title to File Download
ru_ru: Ссылка в заголовке ведёт на скачивание файла

source: Main Configuration
ru_ru: Основные настройки

source: Main WP Search Tweaks
ru_ru: Настройки главного поиска WP

source: Maximum Word Frequency
ru_ru: Максимальная частота слова

source: Maximum Word Frequency should be an integer number from 0 to 100
ru_ru: Максимальная Частота Слов должна быть целым числом от 0 до 100

source: Minimum Word Length
ru_ru: Минимальная длина слова

source: Minimum Word Length should be an integer number from 0 to 50
ru_ru: Минимальная Длина Слова должна быть целым числом от 0 до 50

source: Pending
ru_ru: Ожидающих

source: pending (Pending)
ru_ru: pending (Ожидает)

source: Please specify a number
ru_ru: Задайте число

source: Please specify post ID
ru_ru: Укажите ID записи (поста)

source: Please specify search query
ru_ru: Задайте поисковый запрос

source: Post ID:
ru_ru: ID записи:

source: Post Status:
ru_ru: Статус поста:

source: Post Type:
ru_ru: Тип записи:

source: posts
ru_ru: записей

source: posts per page
ru_ru: записей на странице

source: Pre-indexing Filter Tester
ru_ru: Тестер Пре-индекс фильтра

source: private (Private)
ru_ru: private (Скрытый)

source: publish (Published)
ru_ru: publish (Опубликован)

source: Query:
ru_ru: Запрос:

source: Rebuild Index
ru_ru: Перестроить индекс

source: Relevance
ru_ru: Релевантность

source: Resetting
ru_ru: Сбрасываем

source: Results of Pre-indexing Filter Tester for Post ID = %s
ru_ru: Результаты тестирования Пре-индекс фильтра для записи Post ID = %s

source: Results of search for query = "%s"
ru_ru: Результат поиска по запросу = "%s"

source: Sandbox Area
ru_ru: Песочница

source: Save Changes
ru_ru: Сохранить

source: Search and Relevance Settings
ru_ru: Настройки поиска и релевантности

source: Search Engine Status
ru_ru: Статус поискового движка

source: Search Tester
ru_ru: Тестер поиска

source: Settings
ru_ru: Настройки

source: Shown <span>%1s</span> from <b>%2s</b>
ru_ru: Показано <span>%1s</span> из <b>%2s</b>

source: Status
ru_ru: Статус

source: Stop Words
ru_ru: Стоп-слова

source: Test Filter
ru_ru: Тестировать

source: Test Search
ru_ru: Тестировать

source: The action will rebuild the search index, which could take some time. Are you sure?
ru_ru: Это действие запустит полное перестроение индекса, что займёт некоторое время. Вы уверены, что хотите это сделать?

source: The form is outdated. Please refresh the page and try again.
ru_ru: Страница устарела. Пожалуйста, обновите страницу и попробуйте снова.

source: The post with specified ID is not found.
ru_ru: Запись с указанным ID не обнаружена.

source: The weight value of cluster "%s" should be numeric value from 0.0 to 1.0
ru_ru: Значение веса кластера "%s" должно быть числом от 0.0 до 1.0

source: the, a, an, ...etc
ru_ru: и, а, для, как, бы... и т.д.

source: There are errors
ru_ru: Обнаружены ошибки

source: This plugin requires WordPress 3.0 or newer. Please update your WordPress installation to activate this plugin.
ru_ru: Этот плагин требует WordPress 3.0 или более новый. Пожалуйста, обновите ваш WordPress для активации плагина.

source: Time spent: <b>%.3f</b> sec
ru_ru: Затрачено времени: <b>%.3f</b> сек

source: Title, Thumbnail, Excerpt
ru_ru: Заголовок, Иконка и Цитата

source: Token
ru_ru: Токен

source: trash (Trash)
ru_ru: trash (В корзине)

source: Type
ru_ru: Тип

source: Useful Information
ru_ru: Информация

source: WP FullText Search Options
ru_ru: Опции WP FullText Search

source: WPFTS can output search results in a Google-like way - showing only sentences which contains search words and highlighting them. Wordpress by default does not show any content for result items if the items are attachments. <b>Pro version only</b>: Smart Excerpts function can output attachment content too. <a href="https://fulltextsearch.org/documentation/#smart_excerpts" target="_blank">Check details</a>.
ru_ru: WPFTS может выводить результаты поиска, похожие на Google - отображать только предложения, в которых встречаются поисковые фразы и подсвечивать их. Wordpress по умолчанию не выводит никакого содержимого в результатах поиска для файлов. <b>Только в Pro версии</b>: Функция Smart Excerpts может выводить содержимое файлов тоже. <a href="https://fulltextsearch.org/documentation/#smart_excerpts" target="_blank">Посмотреть детали</a>.

source: WPFTS Documentation
ru_ru: WPFTS Документация

source: WPFTS Home
ru_ru: WPFTS Домашняя страница

source: You can test search with any query here. Standard wordpress <b>WP_Query</b> object with WPFTS features will be used.
ru_ru: Вы можете протестировать любой запрос здесь. При поиске будет использован стандартный объект <b>WP_Query</b> с дополнительными функциями от WPFTS.

source: You can test your own <b>wpfts_index_post</b> filter here. Just enter an ID of a post you want and press Test Filter button.
ru_ru: Вы можете протестировать ваш собственный фильтр <b>wpfts_index_post</b> здесь. Просто введите ID записи (поста) и нажмите кнопку Тестировать.
